name: "ResNet269"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param { shape { dim: __EXP_DEVICE_BATCH__ dim: 3 dim: 224 dim: 224 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 3
    kernel_size: 7
    stride: 2
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn2c_branch2c"
  type: "BatchNorm"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale2c_branch2c"
  type: "Scale"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c"
  type: "Eltwise"
  bottom: "res2b"
  bottom: "res2c_branch2c"
  top: "res2c"
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch1"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn3a_branch1"
  type: "BatchNorm"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch1"
  type: "Scale"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "bn3a_branch2a"
  type: "BatchNorm"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2a"
  type: "Scale"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2a_relu"
  type: "ReLU"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
}
layer {
  name: "res3a_branch2b"
  type: "Convolution"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3a_branch2b"
  type: "BatchNorm"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2b"
  type: "Scale"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2b_relu"
  type: "ReLU"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
}
layer {
  name: "res3a_branch2c"
  type: "Convolution"
  bottom: "res3a_branch2b"
  top: "res3a_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3a_branch2c"
  type: "BatchNorm"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3a_branch2c"
  type: "Scale"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a"
  type: "Eltwise"
  bottom: "res3a_branch1"
  bottom: "res3a_branch2c"
  top: "res3a"
}
layer {
  name: "res3a_relu"
  type: "ReLU"
  bottom: "res3a"
  top: "res3a"
}
layer {
  name: "res3b1_branch2a"
  type: "Convolution"
  bottom: "res3a"
  top: "res3b1_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2a"
  type: "BatchNorm"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2a"
  type: "Scale"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2a_relu"
  type: "ReLU"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2a"
}
layer {
  name: "res3b1_branch2b"
  type: "Convolution"
  bottom: "res3b1_branch2a"
  top: "res3b1_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2b"
  type: "BatchNorm"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2b"
  type: "Scale"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1_branch2b_relu"
  type: "ReLU"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2b"
}
layer {
  name: "res3b1_branch2c"
  type: "Convolution"
  bottom: "res3b1_branch2b"
  top: "res3b1_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b1_branch2c"
  type: "BatchNorm"
  bottom: "res3b1_branch2c"
  top: "res3b1_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b1_branch2c"
  type: "Scale"
  bottom: "res3b1_branch2c"
  top: "res3b1_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b1"
  type: "Eltwise"
  bottom: "res3a"
  bottom: "res3b1_branch2c"
  top: "res3b1"
}
layer {
  name: "res3b1_relu"
  type: "ReLU"
  bottom: "res3b1"
  top: "res3b1"
}
layer {
  name: "res3b2_branch2a"
  type: "Convolution"
  bottom: "res3b1"
  top: "res3b2_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2a"
  type: "BatchNorm"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2a"
  type: "Scale"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2a_relu"
  type: "ReLU"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2a"
}
layer {
  name: "res3b2_branch2b"
  type: "Convolution"
  bottom: "res3b2_branch2a"
  top: "res3b2_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2b"
  type: "BatchNorm"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2b"
  type: "Scale"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2_branch2b_relu"
  type: "ReLU"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2b"
}
layer {
  name: "res3b2_branch2c"
  type: "Convolution"
  bottom: "res3b2_branch2b"
  top: "res3b2_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b2_branch2c"
  type: "BatchNorm"
  bottom: "res3b2_branch2c"
  top: "res3b2_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b2_branch2c"
  type: "Scale"
  bottom: "res3b2_branch2c"
  top: "res3b2_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b2"
  type: "Eltwise"
  bottom: "res3b1"
  bottom: "res3b2_branch2c"
  top: "res3b2"
}
layer {
  name: "res3b2_relu"
  type: "ReLU"
  bottom: "res3b2"
  top: "res3b2"
}
layer {
  name: "res3b3_branch2a"
  type: "Convolution"
  bottom: "res3b2"
  top: "res3b3_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2a"
  type: "BatchNorm"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2a"
  type: "Scale"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2a_relu"
  type: "ReLU"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2a"
}
layer {
  name: "res3b3_branch2b"
  type: "Convolution"
  bottom: "res3b3_branch2a"
  top: "res3b3_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2b"
  type: "BatchNorm"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2b"
  type: "Scale"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3_branch2b_relu"
  type: "ReLU"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2b"
}
layer {
  name: "res3b3_branch2c"
  type: "Convolution"
  bottom: "res3b3_branch2b"
  top: "res3b3_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b3_branch2c"
  type: "BatchNorm"
  bottom: "res3b3_branch2c"
  top: "res3b3_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b3_branch2c"
  type: "Scale"
  bottom: "res3b3_branch2c"
  top: "res3b3_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b3"
  type: "Eltwise"
  bottom: "res3b2"
  bottom: "res3b3_branch2c"
  top: "res3b3"
}
layer {
  name: "res3b3_relu"
  type: "ReLU"
  bottom: "res3b3"
  top: "res3b3"
}
layer {
  name: "res3b4_branch2a"
  type: "Convolution"
  bottom: "res3b3"
  top: "res3b4_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b4_branch2a"
  type: "BatchNorm"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b4_branch2a"
  type: "Scale"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b4_branch2a_relu"
  type: "ReLU"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2a"
}
layer {
  name: "res3b4_branch2b"
  type: "Convolution"
  bottom: "res3b4_branch2a"
  top: "res3b4_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b4_branch2b"
  type: "BatchNorm"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b4_branch2b"
  type: "Scale"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b4_branch2b_relu"
  type: "ReLU"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2b"
}
layer {
  name: "res3b4_branch2c"
  type: "Convolution"
  bottom: "res3b4_branch2b"
  top: "res3b4_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b4_branch2c"
  type: "BatchNorm"
  bottom: "res3b4_branch2c"
  top: "res3b4_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b4_branch2c"
  type: "Scale"
  bottom: "res3b4_branch2c"
  top: "res3b4_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b4"
  type: "Eltwise"
  bottom: "res3b3"
  bottom: "res3b4_branch2c"
  top: "res3b4"
}
layer {
  name: "res3b4_relu"
  type: "ReLU"
  bottom: "res3b4"
  top: "res3b4"
}
layer {
  name: "res3b5_branch2a"
  type: "Convolution"
  bottom: "res3b4"
  top: "res3b5_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b5_branch2a"
  type: "BatchNorm"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b5_branch2a"
  type: "Scale"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b5_branch2a_relu"
  type: "ReLU"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2a"
}
layer {
  name: "res3b5_branch2b"
  type: "Convolution"
  bottom: "res3b5_branch2a"
  top: "res3b5_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b5_branch2b"
  type: "BatchNorm"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b5_branch2b"
  type: "Scale"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b5_branch2b_relu"
  type: "ReLU"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2b"
}
layer {
  name: "res3b5_branch2c"
  type: "Convolution"
  bottom: "res3b5_branch2b"
  top: "res3b5_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b5_branch2c"
  type: "BatchNorm"
  bottom: "res3b5_branch2c"
  top: "res3b5_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b5_branch2c"
  type: "Scale"
  bottom: "res3b5_branch2c"
  top: "res3b5_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b5"
  type: "Eltwise"
  bottom: "res3b4"
  bottom: "res3b5_branch2c"
  top: "res3b5"
}
layer {
  name: "res3b5_relu"
  type: "ReLU"
  bottom: "res3b5"
  top: "res3b5"
}
layer {
  name: "res3b6_branch2a"
  type: "Convolution"
  bottom: "res3b5"
  top: "res3b6_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b6_branch2a"
  type: "BatchNorm"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b6_branch2a"
  type: "Scale"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b6_branch2a_relu"
  type: "ReLU"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2a"
}
layer {
  name: "res3b6_branch2b"
  type: "Convolution"
  bottom: "res3b6_branch2a"
  top: "res3b6_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b6_branch2b"
  type: "BatchNorm"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b6_branch2b"
  type: "Scale"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b6_branch2b_relu"
  type: "ReLU"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2b"
}
layer {
  name: "res3b6_branch2c"
  type: "Convolution"
  bottom: "res3b6_branch2b"
  top: "res3b6_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b6_branch2c"
  type: "BatchNorm"
  bottom: "res3b6_branch2c"
  top: "res3b6_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b6_branch2c"
  type: "Scale"
  bottom: "res3b6_branch2c"
  top: "res3b6_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b6"
  type: "Eltwise"
  bottom: "res3b5"
  bottom: "res3b6_branch2c"
  top: "res3b6"
}
layer {
  name: "res3b6_relu"
  type: "ReLU"
  bottom: "res3b6"
  top: "res3b6"
}
layer {
  name: "res3b7_branch2a"
  type: "Convolution"
  bottom: "res3b6"
  top: "res3b7_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b7_branch2a"
  type: "BatchNorm"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b7_branch2a"
  type: "Scale"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b7_branch2a_relu"
  type: "ReLU"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2a"
}
layer {
  name: "res3b7_branch2b"
  type: "Convolution"
  bottom: "res3b7_branch2a"
  top: "res3b7_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b7_branch2b"
  type: "BatchNorm"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b7_branch2b"
  type: "Scale"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b7_branch2b_relu"
  type: "ReLU"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2b"
}
layer {
  name: "res3b7_branch2c"
  type: "Convolution"
  bottom: "res3b7_branch2b"
  top: "res3b7_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b7_branch2c"
  type: "BatchNorm"
  bottom: "res3b7_branch2c"
  top: "res3b7_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b7_branch2c"
  type: "Scale"
  bottom: "res3b7_branch2c"
  top: "res3b7_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b7"
  type: "Eltwise"
  bottom: "res3b6"
  bottom: "res3b7_branch2c"
  top: "res3b7"
}
layer {
  name: "res3b7_relu"
  type: "ReLU"
  bottom: "res3b7"
  top: "res3b7"
}
layer {
  name: "res3b8_branch2a"
  type: "Convolution"
  bottom: "res3b7"
  top: "res3b8_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b8_branch2a"
  type: "BatchNorm"
  bottom: "res3b8_branch2a"
  top: "res3b8_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b8_branch2a"
  type: "Scale"
  bottom: "res3b8_branch2a"
  top: "res3b8_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b8_branch2a_relu"
  type: "ReLU"
  bottom: "res3b8_branch2a"
  top: "res3b8_branch2a"
}
layer {
  name: "res3b8_branch2b"
  type: "Convolution"
  bottom: "res3b8_branch2a"
  top: "res3b8_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b8_branch2b"
  type: "BatchNorm"
  bottom: "res3b8_branch2b"
  top: "res3b8_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b8_branch2b"
  type: "Scale"
  bottom: "res3b8_branch2b"
  top: "res3b8_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b8_branch2b_relu"
  type: "ReLU"
  bottom: "res3b8_branch2b"
  top: "res3b8_branch2b"
}
layer {
  name: "res3b8_branch2c"
  type: "Convolution"
  bottom: "res3b8_branch2b"
  top: "res3b8_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b8_branch2c"
  type: "BatchNorm"
  bottom: "res3b8_branch2c"
  top: "res3b8_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b8_branch2c"
  type: "Scale"
  bottom: "res3b8_branch2c"
  top: "res3b8_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b8"
  type: "Eltwise"
  bottom: "res3b7"
  bottom: "res3b8_branch2c"
  top: "res3b8"
}
layer {
  name: "res3b8_relu"
  type: "ReLU"
  bottom: "res3b8"
  top: "res3b8"
}
layer {
  name: "res3b9_branch2a"
  type: "Convolution"
  bottom: "res3b8"
  top: "res3b9_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b9_branch2a"
  type: "BatchNorm"
  bottom: "res3b9_branch2a"
  top: "res3b9_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b9_branch2a"
  type: "Scale"
  bottom: "res3b9_branch2a"
  top: "res3b9_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b9_branch2a_relu"
  type: "ReLU"
  bottom: "res3b9_branch2a"
  top: "res3b9_branch2a"
}
layer {
  name: "res3b9_branch2b"
  type: "Convolution"
  bottom: "res3b9_branch2a"
  top: "res3b9_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b9_branch2b"
  type: "BatchNorm"
  bottom: "res3b9_branch2b"
  top: "res3b9_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b9_branch2b"
  type: "Scale"
  bottom: "res3b9_branch2b"
  top: "res3b9_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b9_branch2b_relu"
  type: "ReLU"
  bottom: "res3b9_branch2b"
  top: "res3b9_branch2b"
}
layer {
  name: "res3b9_branch2c"
  type: "Convolution"
  bottom: "res3b9_branch2b"
  top: "res3b9_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b9_branch2c"
  type: "BatchNorm"
  bottom: "res3b9_branch2c"
  top: "res3b9_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b9_branch2c"
  type: "Scale"
  bottom: "res3b9_branch2c"
  top: "res3b9_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b9"
  type: "Eltwise"
  bottom: "res3b8"
  bottom: "res3b9_branch2c"
  top: "res3b9"
}
layer {
  name: "res3b9_relu"
  type: "ReLU"
  bottom: "res3b9"
  top: "res3b9"
}
layer {
  name: "res3b10_branch2a"
  type: "Convolution"
  bottom: "res3b9"
  top: "res3b10_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b10_branch2a"
  type: "BatchNorm"
  bottom: "res3b10_branch2a"
  top: "res3b10_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b10_branch2a"
  type: "Scale"
  bottom: "res3b10_branch2a"
  top: "res3b10_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b10_branch2a_relu"
  type: "ReLU"
  bottom: "res3b10_branch2a"
  top: "res3b10_branch2a"
}
layer {
  name: "res3b10_branch2b"
  type: "Convolution"
  bottom: "res3b10_branch2a"
  top: "res3b10_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b10_branch2b"
  type: "BatchNorm"
  bottom: "res3b10_branch2b"
  top: "res3b10_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b10_branch2b"
  type: "Scale"
  bottom: "res3b10_branch2b"
  top: "res3b10_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b10_branch2b_relu"
  type: "ReLU"
  bottom: "res3b10_branch2b"
  top: "res3b10_branch2b"
}
layer {
  name: "res3b10_branch2c"
  type: "Convolution"
  bottom: "res3b10_branch2b"
  top: "res3b10_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b10_branch2c"
  type: "BatchNorm"
  bottom: "res3b10_branch2c"
  top: "res3b10_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b10_branch2c"
  type: "Scale"
  bottom: "res3b10_branch2c"
  top: "res3b10_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b10"
  type: "Eltwise"
  bottom: "res3b9"
  bottom: "res3b10_branch2c"
  top: "res3b10"
}
layer {
  name: "res3b10_relu"
  type: "ReLU"
  bottom: "res3b10"
  top: "res3b10"
}
layer {
  name: "res3b11_branch2a"
  type: "Convolution"
  bottom: "res3b10"
  top: "res3b11_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b11_branch2a"
  type: "BatchNorm"
  bottom: "res3b11_branch2a"
  top: "res3b11_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b11_branch2a"
  type: "Scale"
  bottom: "res3b11_branch2a"
  top: "res3b11_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b11_branch2a_relu"
  type: "ReLU"
  bottom: "res3b11_branch2a"
  top: "res3b11_branch2a"
}
layer {
  name: "res3b11_branch2b"
  type: "Convolution"
  bottom: "res3b11_branch2a"
  top: "res3b11_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b11_branch2b"
  type: "BatchNorm"
  bottom: "res3b11_branch2b"
  top: "res3b11_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b11_branch2b"
  type: "Scale"
  bottom: "res3b11_branch2b"
  top: "res3b11_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b11_branch2b_relu"
  type: "ReLU"
  bottom: "res3b11_branch2b"
  top: "res3b11_branch2b"
}
layer {
  name: "res3b11_branch2c"
  type: "Convolution"
  bottom: "res3b11_branch2b"
  top: "res3b11_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b11_branch2c"
  type: "BatchNorm"
  bottom: "res3b11_branch2c"
  top: "res3b11_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b11_branch2c"
  type: "Scale"
  bottom: "res3b11_branch2c"
  top: "res3b11_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b11"
  type: "Eltwise"
  bottom: "res3b10"
  bottom: "res3b11_branch2c"
  top: "res3b11"
}
layer {
  name: "res3b11_relu"
  type: "ReLU"
  bottom: "res3b11"
  top: "res3b11"
}
layer {
  name: "res3b12_branch2a"
  type: "Convolution"
  bottom: "res3b11"
  top: "res3b12_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b12_branch2a"
  type: "BatchNorm"
  bottom: "res3b12_branch2a"
  top: "res3b12_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b12_branch2a"
  type: "Scale"
  bottom: "res3b12_branch2a"
  top: "res3b12_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b12_branch2a_relu"
  type: "ReLU"
  bottom: "res3b12_branch2a"
  top: "res3b12_branch2a"
}
layer {
  name: "res3b12_branch2b"
  type: "Convolution"
  bottom: "res3b12_branch2a"
  top: "res3b12_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b12_branch2b"
  type: "BatchNorm"
  bottom: "res3b12_branch2b"
  top: "res3b12_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b12_branch2b"
  type: "Scale"
  bottom: "res3b12_branch2b"
  top: "res3b12_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b12_branch2b_relu"
  type: "ReLU"
  bottom: "res3b12_branch2b"
  top: "res3b12_branch2b"
}
layer {
  name: "res3b12_branch2c"
  type: "Convolution"
  bottom: "res3b12_branch2b"
  top: "res3b12_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b12_branch2c"
  type: "BatchNorm"
  bottom: "res3b12_branch2c"
  top: "res3b12_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b12_branch2c"
  type: "Scale"
  bottom: "res3b12_branch2c"
  top: "res3b12_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b12"
  type: "Eltwise"
  bottom: "res3b11"
  bottom: "res3b12_branch2c"
  top: "res3b12"
}
layer {
  name: "res3b12_relu"
  type: "ReLU"
  bottom: "res3b12"
  top: "res3b12"
}
layer {
  name: "res3b13_branch2a"
  type: "Convolution"
  bottom: "res3b12"
  top: "res3b13_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b13_branch2a"
  type: "BatchNorm"
  bottom: "res3b13_branch2a"
  top: "res3b13_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b13_branch2a"
  type: "Scale"
  bottom: "res3b13_branch2a"
  top: "res3b13_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b13_branch2a_relu"
  type: "ReLU"
  bottom: "res3b13_branch2a"
  top: "res3b13_branch2a"
}
layer {
  name: "res3b13_branch2b"
  type: "Convolution"
  bottom: "res3b13_branch2a"
  top: "res3b13_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b13_branch2b"
  type: "BatchNorm"
  bottom: "res3b13_branch2b"
  top: "res3b13_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b13_branch2b"
  type: "Scale"
  bottom: "res3b13_branch2b"
  top: "res3b13_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b13_branch2b_relu"
  type: "ReLU"
  bottom: "res3b13_branch2b"
  top: "res3b13_branch2b"
}
layer {
  name: "res3b13_branch2c"
  type: "Convolution"
  bottom: "res3b13_branch2b"
  top: "res3b13_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b13_branch2c"
  type: "BatchNorm"
  bottom: "res3b13_branch2c"
  top: "res3b13_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b13_branch2c"
  type: "Scale"
  bottom: "res3b13_branch2c"
  top: "res3b13_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b13"
  type: "Eltwise"
  bottom: "res3b12"
  bottom: "res3b13_branch2c"
  top: "res3b13"
}
layer {
  name: "res3b13_relu"
  type: "ReLU"
  bottom: "res3b13"
  top: "res3b13"
}
layer {
  name: "res3b14_branch2a"
  type: "Convolution"
  bottom: "res3b13"
  top: "res3b14_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b14_branch2a"
  type: "BatchNorm"
  bottom: "res3b14_branch2a"
  top: "res3b14_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b14_branch2a"
  type: "Scale"
  bottom: "res3b14_branch2a"
  top: "res3b14_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b14_branch2a_relu"
  type: "ReLU"
  bottom: "res3b14_branch2a"
  top: "res3b14_branch2a"
}
layer {
  name: "res3b14_branch2b"
  type: "Convolution"
  bottom: "res3b14_branch2a"
  top: "res3b14_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b14_branch2b"
  type: "BatchNorm"
  bottom: "res3b14_branch2b"
  top: "res3b14_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b14_branch2b"
  type: "Scale"
  bottom: "res3b14_branch2b"
  top: "res3b14_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b14_branch2b_relu"
  type: "ReLU"
  bottom: "res3b14_branch2b"
  top: "res3b14_branch2b"
}
layer {
  name: "res3b14_branch2c"
  type: "Convolution"
  bottom: "res3b14_branch2b"
  top: "res3b14_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b14_branch2c"
  type: "BatchNorm"
  bottom: "res3b14_branch2c"
  top: "res3b14_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b14_branch2c"
  type: "Scale"
  bottom: "res3b14_branch2c"
  top: "res3b14_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b14"
  type: "Eltwise"
  bottom: "res3b13"
  bottom: "res3b14_branch2c"
  top: "res3b14"
}
layer {
  name: "res3b14_relu"
  type: "ReLU"
  bottom: "res3b14"
  top: "res3b14"
}
layer {
  name: "res3b15_branch2a"
  type: "Convolution"
  bottom: "res3b14"
  top: "res3b15_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b15_branch2a"
  type: "BatchNorm"
  bottom: "res3b15_branch2a"
  top: "res3b15_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b15_branch2a"
  type: "Scale"
  bottom: "res3b15_branch2a"
  top: "res3b15_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b15_branch2a_relu"
  type: "ReLU"
  bottom: "res3b15_branch2a"
  top: "res3b15_branch2a"
}
layer {
  name: "res3b15_branch2b"
  type: "Convolution"
  bottom: "res3b15_branch2a"
  top: "res3b15_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b15_branch2b"
  type: "BatchNorm"
  bottom: "res3b15_branch2b"
  top: "res3b15_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b15_branch2b"
  type: "Scale"
  bottom: "res3b15_branch2b"
  top: "res3b15_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b15_branch2b_relu"
  type: "ReLU"
  bottom: "res3b15_branch2b"
  top: "res3b15_branch2b"
}
layer {
  name: "res3b15_branch2c"
  type: "Convolution"
  bottom: "res3b15_branch2b"
  top: "res3b15_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b15_branch2c"
  type: "BatchNorm"
  bottom: "res3b15_branch2c"
  top: "res3b15_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b15_branch2c"
  type: "Scale"
  bottom: "res3b15_branch2c"
  top: "res3b15_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b15"
  type: "Eltwise"
  bottom: "res3b14"
  bottom: "res3b15_branch2c"
  top: "res3b15"
}
layer {
  name: "res3b15_relu"
  type: "ReLU"
  bottom: "res3b15"
  top: "res3b15"
}
layer {
  name: "res3b16_branch2a"
  type: "Convolution"
  bottom: "res3b15"
  top: "res3b16_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b16_branch2a"
  type: "BatchNorm"
  bottom: "res3b16_branch2a"
  top: "res3b16_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b16_branch2a"
  type: "Scale"
  bottom: "res3b16_branch2a"
  top: "res3b16_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b16_branch2a_relu"
  type: "ReLU"
  bottom: "res3b16_branch2a"
  top: "res3b16_branch2a"
}
layer {
  name: "res3b16_branch2b"
  type: "Convolution"
  bottom: "res3b16_branch2a"
  top: "res3b16_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b16_branch2b"
  type: "BatchNorm"
  bottom: "res3b16_branch2b"
  top: "res3b16_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b16_branch2b"
  type: "Scale"
  bottom: "res3b16_branch2b"
  top: "res3b16_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b16_branch2b_relu"
  type: "ReLU"
  bottom: "res3b16_branch2b"
  top: "res3b16_branch2b"
}
layer {
  name: "res3b16_branch2c"
  type: "Convolution"
  bottom: "res3b16_branch2b"
  top: "res3b16_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b16_branch2c"
  type: "BatchNorm"
  bottom: "res3b16_branch2c"
  top: "res3b16_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b16_branch2c"
  type: "Scale"
  bottom: "res3b16_branch2c"
  top: "res3b16_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b16"
  type: "Eltwise"
  bottom: "res3b15"
  bottom: "res3b16_branch2c"
  top: "res3b16"
}
layer {
  name: "res3b16_relu"
  type: "ReLU"
  bottom: "res3b16"
  top: "res3b16"
}
layer {
  name: "res3b17_branch2a"
  type: "Convolution"
  bottom: "res3b16"
  top: "res3b17_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b17_branch2a"
  type: "BatchNorm"
  bottom: "res3b17_branch2a"
  top: "res3b17_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b17_branch2a"
  type: "Scale"
  bottom: "res3b17_branch2a"
  top: "res3b17_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b17_branch2a_relu"
  type: "ReLU"
  bottom: "res3b17_branch2a"
  top: "res3b17_branch2a"
}
layer {
  name: "res3b17_branch2b"
  type: "Convolution"
  bottom: "res3b17_branch2a"
  top: "res3b17_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b17_branch2b"
  type: "BatchNorm"
  bottom: "res3b17_branch2b"
  top: "res3b17_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b17_branch2b"
  type: "Scale"
  bottom: "res3b17_branch2b"
  top: "res3b17_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b17_branch2b_relu"
  type: "ReLU"
  bottom: "res3b17_branch2b"
  top: "res3b17_branch2b"
}
layer {
  name: "res3b17_branch2c"
  type: "Convolution"
  bottom: "res3b17_branch2b"
  top: "res3b17_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b17_branch2c"
  type: "BatchNorm"
  bottom: "res3b17_branch2c"
  top: "res3b17_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b17_branch2c"
  type: "Scale"
  bottom: "res3b17_branch2c"
  top: "res3b17_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b17"
  type: "Eltwise"
  bottom: "res3b16"
  bottom: "res3b17_branch2c"
  top: "res3b17"
}
layer {
  name: "res3b17_relu"
  type: "ReLU"
  bottom: "res3b17"
  top: "res3b17"
}
layer {
  name: "res3b18_branch2a"
  type: "Convolution"
  bottom: "res3b17"
  top: "res3b18_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b18_branch2a"
  type: "BatchNorm"
  bottom: "res3b18_branch2a"
  top: "res3b18_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b18_branch2a"
  type: "Scale"
  bottom: "res3b18_branch2a"
  top: "res3b18_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b18_branch2a_relu"
  type: "ReLU"
  bottom: "res3b18_branch2a"
  top: "res3b18_branch2a"
}
layer {
  name: "res3b18_branch2b"
  type: "Convolution"
  bottom: "res3b18_branch2a"
  top: "res3b18_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b18_branch2b"
  type: "BatchNorm"
  bottom: "res3b18_branch2b"
  top: "res3b18_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b18_branch2b"
  type: "Scale"
  bottom: "res3b18_branch2b"
  top: "res3b18_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b18_branch2b_relu"
  type: "ReLU"
  bottom: "res3b18_branch2b"
  top: "res3b18_branch2b"
}
layer {
  name: "res3b18_branch2c"
  type: "Convolution"
  bottom: "res3b18_branch2b"
  top: "res3b18_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b18_branch2c"
  type: "BatchNorm"
  bottom: "res3b18_branch2c"
  top: "res3b18_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b18_branch2c"
  type: "Scale"
  bottom: "res3b18_branch2c"
  top: "res3b18_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b18"
  type: "Eltwise"
  bottom: "res3b17"
  bottom: "res3b18_branch2c"
  top: "res3b18"
}
layer {
  name: "res3b18_relu"
  type: "ReLU"
  bottom: "res3b18"
  top: "res3b18"
}
layer {
  name: "res3b19_branch2a"
  type: "Convolution"
  bottom: "res3b18"
  top: "res3b19_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b19_branch2a"
  type: "BatchNorm"
  bottom: "res3b19_branch2a"
  top: "res3b19_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b19_branch2a"
  type: "Scale"
  bottom: "res3b19_branch2a"
  top: "res3b19_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b19_branch2a_relu"
  type: "ReLU"
  bottom: "res3b19_branch2a"
  top: "res3b19_branch2a"
}
layer {
  name: "res3b19_branch2b"
  type: "Convolution"
  bottom: "res3b19_branch2a"
  top: "res3b19_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b19_branch2b"
  type: "BatchNorm"
  bottom: "res3b19_branch2b"
  top: "res3b19_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b19_branch2b"
  type: "Scale"
  bottom: "res3b19_branch2b"
  top: "res3b19_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b19_branch2b_relu"
  type: "ReLU"
  bottom: "res3b19_branch2b"
  top: "res3b19_branch2b"
}
layer {
  name: "res3b19_branch2c"
  type: "Convolution"
  bottom: "res3b19_branch2b"
  top: "res3b19_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b19_branch2c"
  type: "BatchNorm"
  bottom: "res3b19_branch2c"
  top: "res3b19_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b19_branch2c"
  type: "Scale"
  bottom: "res3b19_branch2c"
  top: "res3b19_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b19"
  type: "Eltwise"
  bottom: "res3b18"
  bottom: "res3b19_branch2c"
  top: "res3b19"
}
layer {
  name: "res3b19_relu"
  type: "ReLU"
  bottom: "res3b19"
  top: "res3b19"
}
layer {
  name: "res3b20_branch2a"
  type: "Convolution"
  bottom: "res3b19"
  top: "res3b20_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b20_branch2a"
  type: "BatchNorm"
  bottom: "res3b20_branch2a"
  top: "res3b20_branch2a"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b20_branch2a"
  type: "Scale"
  bottom: "res3b20_branch2a"
  top: "res3b20_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b20_branch2a_relu"
  type: "ReLU"
  bottom: "res3b20_branch2a"
  top: "res3b20_branch2a"
}
layer {
  name: "res3b20_branch2b"
  type: "Convolution"
  bottom: "res3b20_branch2a"
  top: "res3b20_branch2b"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bn3b20_branch2b"
  type: "BatchNorm"
  bottom: "res3b20_branch2b"
  top: "res3b20_branch2b"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b20_branch2b"
  type: "Scale"
  bottom: "res3b20_branch2b"
  top: "res3b20_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b20_branch2b_relu"
  type: "ReLU"
  bottom: "res3b20_branch2b"
  top: "res3b20_branch2b"
}
layer {
  name: "res3b20_branch2c"
  type: "Convolution"
  bottom: "res3b20_branch2b"
  top: "res3b20_branch2c"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "bn3b20_branch2c"
  type: "BatchNorm"
  bottom: "res3b20_branch2c"
  top: "res3b20_branch2c"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale3b20_branch2c"
  type: "Scale"
  bottom: "res3b20_branch2c"
  top: "res3b20_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b20"
  type: "Eltwise"
  bottom: "res3b19"
  bottom: "res3b20_branch2c"
  top: "res3b20"
}
layer {
  name: "res3b20_relu"
  type: "ReLU"
  bottom: "res3b20"
  top: "res3b20"
}
layer {
  name: "res3b21_branch2a"
  type: "Convolution"
  bottom: "res3b20"
  top: "res3b21_branch2a"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
